practice-for-ch-rails-first-routes-long-practice-main/firstroutes/app/controllers/artworks_controller.rb

    def create
        art = Artwork.new(artwork_param)

            if art.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "BEC Photo"], ["image_url", "bec.photo"], ["artist_id", 3], ["created_at", "2022-12-15 20:42:56.615635"], ["updated_at", "2022-12-15 20:42:56.615635"]]

    def show
        art = Artwork.find(params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        art = Artwork.find(params[:id])
        if art.update(artwork_param)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Lizard Photo"], ["image_url", "lizard.photo"], ["updated_at", "2022-12-15 20:44:04.486442"], ["id", 2]]

    def destroy
        art = Artwork.find(params[:id])
        art.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]