practice-for-ch-rails-first-routes-long-practice-main/firstroutes/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # @users = user.all
        # render json: @users

        render json: User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Luis"], ["email", "luis@gmail.com"], ["created_at", "2022-12-14 21:25:57.335391"], ["updated_at", "2022-12-14 21:25:57.335391"]]
---
    def create
        # render json: params
        user = User.new(user_params)
            if user.save